

sample = [72, 77, 77, 79, 79, 81, 82, 84, 84, 85, 85, 85, 85, 85, 86, 87, 87, 88, 88, 88, 89, 89, 89, 89, 90, 90, 91, 91, 91, 91, 92, 92, 92, 92, 92, 93, 93, 94, 94, 94, 94, 95, 95, 96, 96, 96, 96, 96, 97, 97, 97, 97, 98, 98, 98, 98, 98, 98, 99, 99, 99, 99, 99, 99, 100, 100, 101, 101, 102, 102, 103, 103, 104, 104, 105, 105, 105, 106, 107, 107, 108, 108, 108, 108, 109, 109, 112, 112, 112, 113, 113, 115, 117, 119, 120]
n = 95
y = 0.95
"""З нормально розподіленої генеральної сукупності витягнуто вибірку об’ємом n = 95.
Побудувати довірчі інтервали для математичного сподівання та дисперсії з надійністю 0.95."""
# sma = sum(sample)
# print(sma)
# print(sma/95)
# sqrd = [x*x for x in sample]
# sq_sum = sum(sqrd)
# print(sq_sum)
# print(sq_sum/95)
# print((95*96.46315 / 94)**(1/2))"
# print(96.46315 + (1.99*97.48935)/9.747)
print((94*97.48935)/122.223)
print((94*97.48935)/68.618)